Cuprum77/OpenTag/software/STM32WB_BT_TAG/STM32_WPAN/App/app_ble.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    App/app_ble.c
  * @author  MCD Application Team
  * @brief   BLE Application
  *****************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"

#include "app_common.h"

#include "dbg_trace.h"
#include "ble.h"
#include "tl.h"
#include "app_ble.h"

#include "stm32_seq.h"
#include "shci.h"
#include "stm32_lpm.h"
#include "otp.h"

#include "custom_app.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32_lpm.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/**
 * security parameters structure
 */
typedef struct _tSecurityParams
{
  /**
   * IO capability of the device
   */
  uint8_t ioCapability;

  /**
   * Authentication requirement of the device
   * Man In the Middle protection required?
   */
  uint8_t mitm_mode;

  /**
   * bonding mode of the device
   */
  uint8_t bonding_mode;

  /**
   * this variable indicates whether to use a fixed pin
   * during the pairing process or a passkey has to be
   * requested to the application during the pairing process
   * 0 implies use fixed pin and 1 implies request for passkey
   */
  uint8_t Use_Fixed_Pin;

  /**
   * minimum encryption key size requirement
   */
  uint8_t encryptionKeySizeMin;

  /**
   * maximum encryption key size requirement
   */
  uint8_t encryptionKeySizeMax;

  /**
   * fixed pin to be used in the pairing process if
   * Use_Fixed_Pin is set to 1
   */
  uint32_t Fixed_Pin;

  /**
   * this flag indicates whether the host has to initiate
   * the security, wait for pairing or does not have any security
   * requirements.
   * 0x00 : no security required
   * 0x01 : host should initiate security by sending the slave security
   *        request command
   * 0x02 : host need not send the clave security request but it
   * has to wait for paiirng to complete before doing any other
   * processing
   */
  uint8_t initiateSecurity;
  /* USER CODE BEGIN tSecurityParams*/

  /* USER CODE END tSecurityParams */
}tSecurityParams;

/**
 * global context
 * contains the variables common to all
 * services
 */
typedef struct _tBLEProfileGlobalContext
{
  /**
   * security requirements of the host
   */
  tSecurityParams bleSecurityParam;

  /**
   * gap service handle
   */
  uint16_t gapServiceHandle;

  /**
   * device name characteristic handle
   */
  uint16_t devNameCharHandle;

  /**
   * appearance characteristic handle
   */
  uint16_t appearanceCharHandle;

  /**
   * connection handle of the current active connection
   * When not in connection, the handle is set to 0xFFFF
   */
  uint16_t connectionHandle;

  /**
   * length of the UUID list to be used while advertising
   */
  uint8_t advtServUUIDlen;

  /**
   * the UUID list to be used while advertising
   */
  uint8_t advtServUUID[100];
  /* USER CODE BEGIN BleGlobalContext_t*/

  /* USER CODE END BleGlobalContext_t */
}BleGlobalContext_t;

typedef struct
{
  BleGlobalContext_t BleApplicationContext_legacy;
  APP_BLE_ConnStatus_t Device_Connection_Status;
  /* USER CODE BEGIN PTD_1*/

  /* USER CODE END PTD_1 */
}BleApplicationContext_t;

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define FAST_ADV_TIMEOUT               (30*1000*1000/CFG_TS_TICK_VAL) /**< 30s */
#define INITIAL_ADV_TIMEOUT            (60*1000*1000/CFG_TS_TICK_VAL) /**< 60s */

#define BD_ADDR_SIZE_LOCAL    6

/* USER CODE BEGIN PD */
/* Defines how long the tag will stay on and not go to sleep after a cold startup
 * This is useful to connect to a debugger or to check if the advertised payload is correct.
 */
#define COLD_START_ACTIVE_TIME_S 30

/*
* Turn on the LED when sending out advertising data, this is useful for debugging to see when the tag is advertising
* but should be disabled for normal use to save power. 
* (comment out to disable)
*/
#define ENABLE_ADV_LED_DEBUG

/* Defines the address where the airtag keys are put, this can be done with stm32cubeprogrammer, in the erasing and programming section,
 * you put in this address, select the option to NOT skip flash erase and program. The linker in this cubemx project is setup to not overwrite a 64k region after this address.
 */
#define KEY_ADDR_GOOGLE 0x08020000
#define KEY_ADDR_APPLE 0x08030000

#define GOOGLE_EID_LEN_BYTES 20
#define APPLE_KEY_LEN_BYTES 28

#define GOOGLE_NUMKEYS_FIELD_BYTES 2
#define APPLE_NUMKEYS_FIELD_BYTES 1

typedef enum adv_type {
  APPLE = 0,
  GOOGLE = 1
} adv_type_t;

// You can define the order and frequency of advertising here.
// Examples:
// adv_type_t adv_order[] = {APPLE, GOOGLE};          // alternate each cycle
// adv_type_t adv_order[] = {APPLE, APPLE, GOOGLE};   // advertise Apple twice as much as Google
// adv_type_t adv_order[] = {APPLE};                  // only advertise Apple
// adv_type_t adv_order[] = {GOOGLE};                 // only advertise Google
// Note that switching between the advertisement types takes a bit more time and thus energy
// So, it is better to repeat a key a few times before switching
adv_type_t adv_order[] = {APPLE, APPLE, APPLE, GOOGLE, GOOGLE, GOOGLE};

#define ADV_ORDER_LEN (sizeof(adv_order) / sizeof(adv_order[0]))

// Counted on startup and then used later to gate logic (so we can skip the paths that are never advertising)
int num_google = -1;
int num_apple = -1;
size_t adv_order_index = 0;

