Cuprum77/OpenTag/software/STM32WB_BT_TAG/STM32_WPAN/App/app_ble.c
/* Define how often (long) a key will be reused after switching to the next one
 * The interval for one key is (DELAY_IN_S * REUSE_CYCLES => 10s * 360 cycles = changes key every 60 min)
 * Smaller number of cycles = key changes more often, but more keys needed.
 * You can calculate how much time it will take for all keys to be used up and it will roll around:
 * (DELAY_IN_S * REUSE_CYCLES * NUM_KEYS => 10s * 360 cycles * 32 keys = keys will wrap around every 32 hours)
 */
#define REUSE_CYCLES 360

/* A sleep cycle is 10 seconds of sleep, so 2 cycles is 20 seconds of sleep and so on.*/
#define SLEEP_CYCLES 1
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_CmdPacket_t BleCmdBuffer;

static const uint8_t a_MBdAddr[BD_ADDR_SIZE_LOCAL] =
{
  (uint8_t)((CFG_ADV_BD_ADDRESS & 0x0000000000FF)),
  (uint8_t)((CFG_ADV_BD_ADDRESS & 0x00000000FF00) >> 8),
  (uint8_t)((CFG_ADV_BD_ADDRESS & 0x000000FF0000) >> 16),
  (uint8_t)((CFG_ADV_BD_ADDRESS & 0x0000FF000000) >> 24),
  (uint8_t)((CFG_ADV_BD_ADDRESS & 0x00FF00000000) >> 32),
  (uint8_t)((CFG_ADV_BD_ADDRESS & 0xFF0000000000) >> 40)
};

static uint8_t a_BdAddrUdn[BD_ADDR_SIZE_LOCAL];

/**
 *   Identity root key used to derive IRK and DHK(Legacy)
 */
static const uint8_t a_BLE_CfgIrValue[16] = CFG_BLE_IR;

/**
 * Encryption root key used to derive LTK(Legacy) and CSRK
 */
static const uint8_t a_BLE_CfgErValue[16] = CFG_BLE_ER;

/**
 * These are the two tags used to manage a power failure during OTA
 * The MagicKeywordAdress shall be mapped @0x140 from start of the binary image
 * The MagicKeywordvalue is checked in the ble_ota application
 */
PLACE_IN_SECTION("TAG_OTA_END") const uint32_t MagicKeywordValue = 0x94448A29 ;
PLACE_IN_SECTION("TAG_OTA_START") const uint32_t MagicKeywordAddress = (uint32_t)&MagicKeywordValue;

static BleApplicationContext_t BleApplicationContext;

Custom_App_ConnHandle_Not_evt_t HandleNotification;

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
#define SIZE_TAB_CONN_INT            2
float a_ConnInterval[SIZE_TAB_CONN_INT] = {50, 1000}; /* ms */
uint8_t index_con_int, mutex;
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

/**
 * Advertising Data
 */
uint8_t a_AdvData[5] =
{
  4, AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 0x4C, 0x00, 0xAA /* Does this even do anything? */,
};

/* USER CODE BEGIN PV */
const uint8_t apple_adv_data_template[31] = {
  0x1e,       /* Length (30) */                                   // 0            <- Static
  0xff,       /* Manufacturer Specific Data (type 0xff) */        // 1            <- Static
  0x4c, 0x00, /* Company ID (Apple) */                            // 2 3          <- Static
  0x12, 0x19, /* Offline Finding type and length */               // 4 5          <- Static
  0x00,       /* State */                                         // 6            <- Static
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,                 // 7 - 14    }
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,                 // 15 - 22   }  <- 22 bytes of public key
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00,                             // 23 - 28   }
  0x00, /* First two bits */                                      // 29           <- 2 bits of public key
  0x00, /* Hint (0x00) */                                         // 30           <- Static
};

const uint8_t google_adv_data_template[31] = {
    0x02,   // Length                             // 0            <- Static
    0x01,   // Flags data type value              // 1            <- Static
    0x06,   // Flags data                         // 2            <- Static
    0x19,   // Length                             // 3            <- Static
    0x16,   // Service data data type value       // 4            <- Static
    0xAA,   // 16-bit service UUID                // 5            <- Static
    0xFE,   // 16-bit service UUID                // 6            <- Static
    0x41,   // FMDN frame type with unwanted      // 7            <- Static
            // tracking protection mode indication
    0x00, 0x00, 0x00, 0x00, 0x00,                 // 8 - 12   }
    0x00, 0x00, 0x00, 0x00, 0x00,                 // 13 - 17  }   <- 20-byte ephemeral identifier
    0x00, 0x00, 0x00, 0x00, 0x00,                 // 18 - 22  }
    0x00, 0x00, 0x00, 0x00, 0x00,                 // 23 - 27  }
    0x00, 0x00, 0x00, // Hashed flags             // 28 - 30
};

// our own advertising data, because cubemx has a limitation to a max length of 21 for some reason
uint8_t custom_a_AdvData[31] = { 0 };

// set our own variable for the MAC address
uint8_t custom_p_bd_addr[6] = {
  0xFF, 0xCC, 0xCC, 0xCC, 0xCC, 0xFF
};

static uint8_t public_key_apple[APPLE_KEY_LEN_BYTES] = { 0 };
static uint8_t public_key_google[GOOGLE_EID_LEN_BYTES] = { 0 };
static uint8_t google_mac_addr[6] = { 0 };
static bool google_mac_valid = false;

uint8_t key_index_apple = 0;
uint8_t old_key_index_apple = 0;
uint16_t key_count_apple = 0;
uint16_t key_cycle_apple = 0;

uint16_t key_index_google = 0;
uint16_t old_key_index_google = 0;
uint16_t key_count_google = 0;
uint16_t key_cycle_google = 0;

adv_type_t current_adv_type = APPLE;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx(void *p_Payload);
static void BLE_StatusNot(HCI_TL_CmdStatus_t Status);
static void Ble_Tl_Init(void);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress(void);
static void Adv_Request(APP_BLE_ConnStatus_t NewStatus);
static void Adv_Cancel(void);
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
static void BLE_SVC_L2CAP_Conn_Update(uint16_t ConnectionHandle);
static void Connection_Interval_Update_Req(void);
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

/* USER CODE BEGIN PFP */
void SystemClock_Config_ble(void);
RTC_HandleTypeDef hrtc_ble;
static void MX_RTC_Init_ble(void);
static void load_bytes_from_partition(uint8_t *dst, size_t size, uint32_t address);
void set_addr_from_key(uint8_t *addr, uint8_t *public_key, adv_type_t type);
void set_payload_from_key(uint8_t *payload, uint8_t *public_key, adv_type_t type);
adv_type_t get_adv_type_from_order(void);
void advance_adv_order(void);
/* USER CODE END PFP */

