Cuprum77/OpenTag/software/STM32WB_BT_TAG/STM32_WPAN/App/app_ble.c
/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  SHCI_CmdStatus_t status;
#if (RADIO_ACTIVITY_EVENT != 0)
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
#endif /* RADIO_ACTIVITY_EVENT != 0 */
  /* USER CODE BEGIN APP_BLE_Init_1 */
  UTIL_SEQ_Init();

  num_apple = 0;
  num_google = 0;
  // Count the number of keys of each in the sequence
  for (size_t i = 0; i < ADV_ORDER_LEN; i++)
  {
    if (adv_order[i] == APPLE)
    {
      num_apple++;
    }
    else if (adv_order[i] == GOOGLE)
    {
      num_google++;
    }
  }

  current_adv_type = get_adv_type_from_order();
  
  uint8_t keyCountApple[APPLE_NUMKEYS_FIELD_BYTES];
  if (num_apple > 0)
  {
    load_bytes_from_partition(keyCountApple, sizeof(keyCountApple), KEY_ADDR_APPLE);
#if APPLE_NUMKEYS_FIELD_BYTES == 1
    key_count_apple = keyCountApple[0];
#elif APPLE_NUMKEYS_FIELD_BYTES == 2
    key_count_apple = keyCountApple[0] | (keyCountApple[1] << 8);
#endif
  }

  uint8_t keyCountGoogle[GOOGLE_NUMKEYS_FIELD_BYTES];
  if (num_google > 0)
  {
    load_bytes_from_partition(keyCountGoogle, sizeof(keyCountGoogle), KEY_ADDR_GOOGLE);
#if GOOGLE_NUMKEYS_FIELD_BYTES == 1
    key_count_google = keyCountGoogle[0];
#elif GOOGLE_NUMKEYS_FIELD_BYTES == 2
    key_count_google = keyCountGoogle[0] | (keyCountGoogle[1] << 8);
#endif
  }

  // choose a random key to start with
  if (num_apple > 0 && key_count_apple > 0)
  {
	  key_index_apple = HAL_GetTick() % key_count_apple;
  }
  if (num_google > 0 && key_count_google > 0)
  {
	  key_index_google = HAL_GetTick() % key_count_google;
  }

  if(key_count_apple == key_count_google){
	  key_index_google = key_index_apple;
  }

  old_key_index_apple = key_index_apple;
  old_key_index_google = key_index_google;
  key_cycle_apple = 0;
  key_cycle_google = 0;
  

  if (num_apple > 0)
  {
    uint32_t addressApple = APPLE_NUMKEYS_FIELD_BYTES + (key_index_apple * sizeof(public_key_apple)) + KEY_ADDR_APPLE;
    load_bytes_from_partition(public_key_apple, sizeof(public_key_apple), addressApple);
  }

  if (num_google > 0)
  {
    uint32_t addressGoogle = GOOGLE_NUMKEYS_FIELD_BYTES + (key_index_google * sizeof(public_key_google)) + KEY_ADDR_GOOGLE;
    load_bytes_from_partition(public_key_google, sizeof(public_key_google), addressGoogle);
    set_addr_from_key(google_mac_addr, public_key_google, GOOGLE);
    google_mac_valid = true;
  }

  // set the address and payload from the key
  if(current_adv_type == APPLE) {
    set_addr_from_key(custom_p_bd_addr, public_key_apple, current_adv_type);
    set_payload_from_key(custom_a_AdvData, public_key_apple, current_adv_type);
  } else {
    if (google_mac_valid)
    {
      memcpy(custom_p_bd_addr, google_mac_addr, sizeof(custom_p_bd_addr));
    }
    else
    {
      set_addr_from_key(google_mac_addr, public_key_google, GOOGLE);
      google_mac_valid = true;
      memcpy(custom_p_bd_addr, google_mac_addr, sizeof(custom_p_bd_addr));
    }
    set_payload_from_key(custom_a_AdvData, public_key_google, current_adv_type);
  }
  /* USER CODE END APP_BLE_Init_1 */
  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
  {
    {{0,0,0}},                          /**< Header unused */
    {0,                                 /** pBleBufferAddress not used */
     0,                                 /** BleBufferSize not used */
     CFG_BLE_NUM_GATT_ATTRIBUTES,
     CFG_BLE_NUM_GATT_SERVICES,
     CFG_BLE_ATT_VALUE_ARRAY_SIZE,
     CFG_BLE_NUM_LINK,
     CFG_BLE_DATA_LENGTH_EXTENSION,
     CFG_BLE_PREPARE_WRITE_LIST_SIZE,
     CFG_BLE_MBLOCK_COUNT,
     CFG_BLE_MAX_ATT_MTU,
     CFG_BLE_PERIPHERAL_SCA,
     CFG_BLE_CENTRAL_SCA,
     CFG_BLE_LS_SOURCE,
     CFG_BLE_MAX_CONN_EVENT_LENGTH,
     CFG_BLE_HSE_STARTUP_TIME,
     CFG_BLE_VITERBI_MODE,
     CFG_BLE_OPTIONS,
     0,
     CFG_BLE_MAX_COC_INITIATOR_NBR,
     CFG_BLE_MIN_TX_POWER,
     CFG_BLE_MAX_TX_POWER,
     CFG_BLE_RX_MODEL_CONFIG,
     CFG_BLE_MAX_ADV_SET_NBR,
     CFG_BLE_MAX_ADV_DATA_LEN,
     CFG_BLE_TX_PATH_COMPENS,
     CFG_BLE_RX_PATH_COMPENS,
     CFG_BLE_CORE_VERSION,
     CFG_BLE_OPTIONS_EXT
    }
  };

  /**
   * Initialize Ble Transport Layer
   */
  Ble_Tl_Init();

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

  /**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  UTIL_SEQ_RegTask(1<<CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, hci_user_evt_proc);

  /**
   * Starts the BLE Stack on CPU2
   */
  status = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
  if (status != SHCI_Success)
  {
    APP_DBG_MSG("  Fail   : SHCI_C2_BLE_Init command, result: 0x%02x\n\r", status);
    /* if you are here, maybe CPU2 doesn't contain STM32WB_Copro_Wireless_Binaries, see Release_Notes.html */
    Error_Handler();
  }
  else
  {
    APP_DBG_MSG("  Success: SHCI_C2_BLE_Init command\n\r");
  }

  /**
   * Initialization of HCI & GATT & GAP layer
   */
  Ble_Hci_Gap_Gatt_Init();

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * Initialization of the BLE App Context
   */
  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
  BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

  /**
   * From here, all initialization are BLE application specific
   */

  UTIL_SEQ_RegTask(1<<CFG_TASK_ADV_CANCEL_ID, UTIL_SEQ_RFU, Adv_Cancel);

  /* USER CODE BEGIN APP_BLE_Init_4 */
  
  /* USER CODE END APP_BLE_Init_4 */

  /**
   * Initialization of ADV - Ad Manufacturer Element - Support OTA Bit Mask
   */
#if (RADIO_ACTIVITY_EVENT != 0)
  ret = aci_hal_set_radio_activity_mask(0x0006);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%x \n\r", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
  }
#endif /* RADIO_ACTIVITY_EVENT != 0 */

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
  index_con_int = 0;
  mutex = 1;
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

  /**
   * Initialize Custom Template Application
   */
  Custom_APP_Init();

