Cuprum77/OpenTag/software/STM32WB_BT_TAG/STM32_WPAN/App/app_ble.c
          /* USER CODE END ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE*/
          break;

        case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
          APP_DBG_MSG(">>== ACI_GAP_PASS_KEY_REQ_VSEVT_CODE \n");

          ret = aci_gap_pass_key_resp(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, CFG_FIXED_PIN);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_pass_key_resp : Fail, reason: 0x%x\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_pass_key_resp : Success \n");
          }
          /* USER CODE BEGIN ACI_GAP_PASS_KEY_REQ_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_PASS_KEY_REQ_VSEVT_CODE*/
          break;

        case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE:
          APP_DBG_MSG(">>== ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE\n");
          APP_DBG_MSG("     - numeric_value = %ld\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          APP_DBG_MSG("     - Hex_value = %lx\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          ret = aci_gap_numeric_comparison_value_confirm_yesno(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, YES);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_numeric_comparison_value_confirm_yesno-->YES : Fail, reason: 0x%x\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_numeric_comparison_value_confirm_yesno-->YES : Success \n");
          }
          /* USER CODE BEGIN ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE*/
          break;

        case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:
          p_pairing_complete = (aci_gap_pairing_complete_event_rp0*)p_blecore_evt->data;

          APP_DBG_MSG(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE\n");
          if (p_pairing_complete->Status != 0)
          {
            APP_DBG_MSG("     - Pairing KO \n     - Status: 0x%x\n     - Reason: 0x%x\n", p_pairing_complete->Status, p_pairing_complete->Reason);
          }
          else
          {
            APP_DBG_MSG("     - Pairing Success\n");
          }
          APP_DBG_MSG("\n");

          /* USER CODE BEGIN ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/
          break;
        /* PAIRING */
        case ACI_GATT_INDICATION_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GATT_INDICATION_VSEVT_CODE \r");
          aci_gatt_confirm_indication(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
        }
        break;

        /* USER CODE BEGIN BLUE_EVT */

        /* USER CODE END BLUE_EVT */
      }
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE BEGIN EVENT_PCKT */

      /* USER CODE END EVENT_PCKT */

    default:
      /* USER CODE BEGIN ECODE_DEFAULT*/

      /* USER CODE END ECODE_DEFAULT*/
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
  return BleApplicationContext.Device_Connection_Status;
}

/* USER CODE BEGIN FD*/
void perform_advertising_cycle(adv_type_t type, bool rotate){
  static uint16_t adv_delay_len_ms = 18;
  static uint16_t adv_settings_delay_len_ms = 5;
  static uint16_t stop_adv_delay_len_ms = 1;
  static adv_type_t old_adv_type = 0xFF; // invalid value to force update on first run
  tBleStatus ret;
  if(type == APPLE){
    
    // Get the key as needed
    if(old_key_index_apple != key_index_apple){
      // key has changed, update the address and payload
      uint32_t address = APPLE_NUMKEYS_FIELD_BYTES + (key_index_apple * sizeof(public_key_apple)) + KEY_ADDR_APPLE;
      load_bytes_from_partition(public_key_apple, sizeof(public_key_apple), address);

      set_addr_from_key(custom_p_bd_addr, public_key_apple, APPLE);
      set_payload_from_key(custom_a_AdvData, public_key_apple, APPLE);

      // TODO check if this works
      // Ble_Hci_Gap_Gatt_Init();

      old_key_index_apple = key_index_apple;
    }
    
    if(old_adv_type != type){
      // adv type has changed, update the address and payload
      set_addr_from_key(custom_p_bd_addr, public_key_apple, APPLE);
      set_payload_from_key(custom_a_AdvData, public_key_apple, APPLE);
      ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET, CONFIG_DATA_PUBADDR_LEN, (uint8_t*)custom_p_bd_addr);
      if (ret != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> Failed to update Apple advertising address, result: 0x%x\n", ret);
      }
      HAL_Delay(adv_settings_delay_len_ms);
      old_adv_type = type;
    }

    // start advertising
    Adv_Request(APP_BLE_FAST_ADV);
    // wait for a few ms for the 2nd core to start advertising
    HAL_Delay(adv_delay_len_ms);
    // stop advertising
    Adv_Cancel();
    // wait for 1ms for the 2nd core to stop advertising
    HAL_Delay(stop_adv_delay_len_ms);

    // increment key index for next time
    if ((key_cycle_apple >= REUSE_CYCLES) && rotate){
      key_index_apple = (key_index_apple + 1) % key_count_apple; // Back to zero if out of range
      key_cycle_apple = 0;
    }else{
      key_cycle_apple++;
    }

  }else if(type == GOOGLE){
    // Get the key as needed
    if(old_key_index_google != key_index_google){
      // key has changed, update the address and payload
      uint32_t address = GOOGLE_NUMKEYS_FIELD_BYTES + (key_index_google * sizeof(public_key_google)) + KEY_ADDR_GOOGLE;
      load_bytes_from_partition(public_key_google, sizeof(public_key_google), address);

      set_addr_from_key(google_mac_addr, public_key_google, GOOGLE);
      google_mac_valid = true;
      memcpy(custom_p_bd_addr, google_mac_addr, sizeof(custom_p_bd_addr));
      set_payload_from_key(custom_a_AdvData, public_key_google, GOOGLE);

      old_key_index_google = key_index_google;
    }

    if(old_adv_type != type){
      // adv type has changed, update the address and payload
      if (!google_mac_valid)
      {
        set_addr_from_key(google_mac_addr, public_key_google, GOOGLE);
        google_mac_valid = true;
      }
      memcpy(custom_p_bd_addr, google_mac_addr, sizeof(custom_p_bd_addr));
      set_payload_from_key(custom_a_AdvData, public_key_google, GOOGLE);
      ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET, CONFIG_DATA_PUBADDR_LEN, (uint8_t*)custom_p_bd_addr);
      if (ret != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> Failed to update Google advertising address, result: 0x%x\n", ret);
      }
      HAL_Delay(adv_settings_delay_len_ms);
      old_adv_type = type;
    }

    // start advertising
    Adv_Request(APP_BLE_FAST_ADV);

    // wait for a few ms for the 2nd core to start advertising
    HAL_Delay(adv_delay_len_ms);

