Cuprum77/OpenTag/software/STM32WB_BT_TAG/STM32_WPAN/App/app_ble.c
    // stop advertising
    Adv_Cancel();

    // wait for 1ms for the 2nd core to stop advertising
    HAL_Delay(stop_adv_delay_len_ms);

    // increment key index for next time
    if ((key_cycle_google >= REUSE_CYCLES) && rotate){
      key_index_google = (key_index_google + 1) % key_count_google; // Back to zero if out of range
      key_cycle_google = 0;
    }else{
      key_cycle_google++;
    }

  }
}

void Send_Out_Adv(void){

  #ifdef ENABLE_ADV_LED_DEBUG
    // turn on LED
    HAL_GPIO_WritePin(LED_PIN_GPIO_Port, LED_PIN_Pin, GPIO_PIN_SET);
  #endif
  
  if(cold_start_flag){
	  // keep the tag awake for the cold-start window
	  for(int i = 0; i < COLD_START_ACTIVE_TIME_S; i++){
		  HAL_GPIO_WritePin(LED_PIN_GPIO_Port, LED_PIN_Pin, GPIO_PIN_SET);
		  HAL_Delay(100);
      // Advertise both, for debugging purposes
      {
        current_adv_type = get_adv_type_from_order();
        perform_advertising_cycle(current_adv_type, false);
        advance_adv_order();
      }
		  HAL_GPIO_WritePin(LED_PIN_GPIO_Port, LED_PIN_Pin, GPIO_PIN_RESET);
		  HAL_Delay(900);
	  }

	  // blink one last time for a second to indicate that we are going to sleep
	  HAL_GPIO_WritePin(LED_PIN_GPIO_Port, LED_PIN_Pin, GPIO_PIN_SET);
	  HAL_Delay(1000);
	  HAL_GPIO_WritePin(LED_PIN_GPIO_Port, LED_PIN_Pin, GPIO_PIN_RESET);
	  cold_start_flag = false;
  }

  current_adv_type = get_adv_type_from_order();
  perform_advertising_cycle(current_adv_type, true);
  advance_adv_order();

  #ifdef ENABLE_ADV_LED_DEBUG
    // turn off LED
    HAL_GPIO_WritePin(LED_PIN_GPIO_Port, LED_PIN_Pin, GPIO_PIN_RESET);
  #endif

  // go back into deep sleep
  for(int i = 0; i < SLEEP_CYCLES; i++){
    //////// DEEP SLEEP START (~10seconds)
    HAL_SuspendTick();
    HAL_RTCEx_SetWakeUpTimer_IT(&hrtc_ble, 0x5554, RTC_WAKEUPCLOCK_RTCCLK_DIV16);
    /* Enter STOP 2 mode */
    HAL_PWREx_EnterSTOP2Mode(PWR_STOPENTRY_WFI);
    HAL_RTCEx_DeactivateWakeUpTimer(&hrtc_ble);
    SystemClock_Config_ble();
    HAL_ResumeTick();
    //////// DEEP SLEEP END  
  }
  
  UTIL_SEQ_SetTask((1 << 9), CFG_SCH_PRIO_0);
}

void set_payload_from_key(uint8_t *payload, uint8_t *public_key, adv_type_t type)
{
  if(type == APPLE){
    // Copy template into payload
    memcpy(payload, apple_adv_data_template, sizeof(apple_adv_data_template));

    // copy the key into the payload
    // last 22 bytes
    memcpy(&payload[7], &public_key[6], 22);
    // append two bits of public key
    payload[29] = public_key[0] >> 6;
  }else if(type == GOOGLE){
    // Copy template into payload
    memcpy(payload, google_adv_data_template, sizeof(google_adv_data_template));
    // copy 20-byte public key into payload
    memcpy(&payload[8], public_key, GOOGLE_EID_LEN_BYTES);
  }
}

void set_addr_from_key(uint8_t *addr, uint8_t *public_key, adv_type_t type)
{
  if(type == APPLE){
    addr[5] = public_key[0] | 0b11000000;
    addr[4] = public_key[1];
    addr[3] = public_key[2];
    addr[2] = public_key[3];
    addr[1] = public_key[4];
    addr[0] = public_key[5];
  }else if(type == GOOGLE){
    for (int i = 0; i < 6; i++) {
      uint8_t rng_byte = HAL_GetTick() % 256; // not cryptographically secure, but it's mixed with the key so it's fine
      addr[i] = public_key[i] ^ rng_byte; // XOR with a byte from the key to add some variability, since Google allows us to set the MAC to be random
    }
    // static random bits per: https://www.bluetooth.com/wp-content/uploads/Files/Specification/HTML/Core-54/out/en/low-energy-controller/link-layer-specification.html
    addr[5] |= 0b11000000; // set the two most significant bits to 1 to indicate that this is a static random address
  }
}

adv_type_t get_adv_type_from_order(void)
{
  return adv_order[adv_order_index];
}

void advance_adv_order(void)
{
  adv_order_index = (adv_order_index + 1) % ADV_ORDER_LEN;
}

static void load_bytes_from_partition(uint8_t *dst, size_t size, uint32_t address) {
  size_t i = 0;
  while (i * sizeof(uint32_t) < size) {  // Ensures loop runs even if size < 4
    uint32_t value = *(volatile uint32_t*)(address + i * sizeof(uint32_t));
    for (size_t j = 0; j < sizeof(uint32_t); j++) {
      size_t idx = i * sizeof(uint32_t) + j;
      if (idx >= size) {  // Prevents overflow
        return;
      }
      dst[idx] = (value >> (j * 8)) & 0xFF;
    }
    i++;
  }
}

void SystemClock_Config_ble(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure LSE Drive Capability
  */
  HAL_PWR_EnableBkUpAccess();
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_MEDIUMHIGH);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_HSE
                              |RCC_OSCILLATORTYPE_LSE|RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.MSICalibrationValue = RCC_MSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_10;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure the SYSCLKSource, HCLK, PCLK1 and PCLK2 clocks dividers
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK4|RCC_CLOCKTYPE_HCLK2
                              |RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_MSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.AHBCLK2Divider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLK4Divider = RCC_SYSCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    Error_Handler();
  }
}

static void MX_RTC_Init_ble(void)
{

  /* USER CODE BEGIN RTC_Init 0 */

  /* USER CODE END RTC_Init 0 */

  /* USER CODE BEGIN RTC_Init 1 */

